app/Models/UsersModels.php

    public function verifyAcount($phonenumber)
    {
        //$db = \Config\Database::connect();
        $builder = $this->db->table('tbl_users');
        $builder->select('phonenumber');
        $builder->where('phonenumber', $phonenumber);
        $result = $builder->get();
---
SELECT `phonenumber`
FROM `tbl_users`
WHERE `phonenumber` = '0328644258'

    public function verifyPass($password)
    {
        //$db = \Config\Database::connect();
        $builder = $this->db->table('tbl_users');
        $builder->select('passwords');
        $builder->where('passwords', $password);
        $result = $builder->get();
---
SELECT `passwords`
FROM `tbl_users`
WHERE `passwords` = '75883732846e5abbf4cf73fee7be2999'